## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_storage_share.cloud_storage_nfs will be created
  + resource "azurerm_storage_share" "cloud_storage_nfs" {
      + access_tier          = "Hot"
      + enabled_protocol     = "NFS"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "cloud-nfs"
      + quota                = 64
      + resource_manager_id  = (known after apply)
      + storage_account_name = "nkcloudstorage"
      + url                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>